Revit 2027 API
BuiltInFailures.SketchFailures.TooFewParamsForSketch Property
 The sketched Structural Rebar element has too many segments to be properly parameterized. Please reduce the number of segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooFewParamsForSketch { get; }
Public Shared ReadOnly Property TooFewParamsForSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooFewParamsForSketch {
	FailureDefinitionId^ get ();
}
static member TooFewParamsForSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace